suburbanembedded/hadoucan-fw/hadoucan-fw/src/STM32_fdcan_tx.cpp
#include "STM32_fdcan_tx.hpp"

#include "lawicel/STM32_FDCAN_DLC.hpp"

#include "CAN_USB_app_config.hpp"
#include "global_app_inst.hpp"

#include "main.h"

#include "freertos_cpp_util/logging/Global_logger.hpp"

#include "stm32h7xx_hal_rcc.h"
#include "stm32h7xx_hal_rcc_ex.h"

#include <array>
#include <algorithm>
#include <stdexcept>

#include <cinttypes>

bool set_can_clk(const uint32_t can_clk)
{
	freertos_util::logging::Logger* const logger = freertos_util::logging::Global_logger::get();
	using freertos_util::logging::LOG_LEVEL;

	logger->log(LOG_LEVEL::DEBUG, "STM32_fdcan_tx::set_can_clk", "set_can_clk %" PRIu32, can_clk);

	const uint32_t hse_clk = HSE_VALUE;
	if(hse_clk != 24000000U)
	{
		logger->log(LOG_LEVEL::ERROR, "STM32_fdcan_tx::set_can_clk", "HSE clock is %" PRIu32 ", requires 24MHz", HSE_VALUE);
		return false;
	}

	RCC_PeriphCLKInitTypeDef periph_config;
	HAL_RCCEx_GetPeriphCLKConfig(&periph_config);

	// HAL_RCCEx_GetPeriphCLKConfig enables all of the clocks...
	// we need to fix the list to the clocks actually used
	periph_config.PeriphClockSelection = RCC_PERIPHCLK_RTC|RCC_PERIPHCLK_FDCAN
                              |RCC_PERIPHCLK_USART1|RCC_PERIPHCLK_RNG
                              |RCC_PERIPHCLK_QSPI;

	bool ret = false;
	switch(periph_config.FdcanClockSelection)
	{
		case RCC_FDCANCLKSOURCE_HSE:
		{
			logger->log(LOG_LEVEL::ERROR, "STM32_fdcan_tx::set_can_clk", "FdcanClockSelection is HSE, requires PLL2");

			ret = true;
			break;
		}
		case RCC_FDCANCLKSOURCE_PLL:
		{
			logger->log(LOG_LEVEL::ERROR, "STM32_fdcan_tx::set_can_clk", "FdcanClockSelection is PLL, requires PLL2");

			ret = false;
			break;
		}
		case RCC_FDCANCLKSOURCE_PLL2:
		{
			switch(can_clk)
			{
				case 24000000U:
				{
					periph_config.PLL2.PLL2M = 2;
					periph_config.PLL2.PLL2N = 20;
					periph_config.PLL2.PLL2Q = 10;

					ret = true;
					break;
				}
				case 60000000U:
				{
					periph_config.PLL2.PLL2M = 2;
					periph_config.PLL2.PLL2N = 20;
					periph_config.PLL2.PLL2Q = 4;

					ret = true;
					break;
				}
				case 80000000U:
				{
					periph_config.PLL2.PLL2M = 2;
					periph_config.PLL2.PLL2N = 20;
					periph_config.PLL2.PLL2Q = 3;

					ret = true;
					break;
				}
				default:
				{
					logger->log(LOG_LEVEL::ERROR, "STM32_fdcan_tx::set_can_clk", "can_clk is not 24, 60, or 80 MHz");

					ret = false;
					break;
				}
			}

			break;
		}
		default:
		{
			logger->log(LOG_LEVEL::ERROR, "STM32_fdcan_tx::set_can_clk", "FdcanClockSelection is unknown, requires PLL2");

			ret = false;
			break;
		}
	}

	if(ret == true)
	{
		if(HAL_RCCEx_PeriphCLKConfig(&periph_config) != HAL_OK)
		{
			logger->log(LOG_LEVEL::ERROR, "STM32_fdcan_tx::set_can_clk", "HAL_RCCEx_PeriphCLKConfig failed");

			ret = false;
		}
	}

	return ret;
}

bool get_can_clk(uint32_t* const can_clk)
{
	freertos_util::logging::Logger* const logger = freertos_util::logging::Global_logger::get();
	using freertos_util::logging::LOG_LEVEL;
	
	const uint32_t hse_clk = HSE_VALUE;

	RCC_PeriphCLKInitTypeDef periph_config;
	HAL_RCCEx_GetPeriphCLKConfig(&periph_config);

	bool ret = false;
	switch(periph_config.FdcanClockSelection)
	{
		case RCC_FDCANCLKSOURCE_HSE:
		{
			*can_clk = hse_clk;
			ret = true;
			break;
		}
		case RCC_FDCANCLKSOURCE_PLL:
		{
			RCC_OscInitTypeDef pll_config;
			HAL_RCC_GetOscConfig(&pll_config);

			const uint32_t m = pll_config.PLL.PLLM;
			const uint32_t n = pll_config.PLL.PLLN;
			const uint32_t q = pll_config.PLL.PLLQ;

			*can_clk = ((hse_clk / m) * n) / q;
			ret = true;
			break;
		}
		case RCC_FDCANCLKSOURCE_PLL2:
		{
			const uint32_t m = periph_config.PLL2.PLL2M;
			const uint32_t n = periph_config.PLL2.PLL2N;
			const uint32_t q = periph_config.PLL2.PLL2Q;

			*can_clk = ((hse_clk / m) * n) / q;
			ret = true;
			break;
		}
		default:
		{
			ret = false;
			break;
		}
	}

	logger->log(LOG_LEVEL::DEBUG, "STM32_fdcan_tx::get_can_clk", "get_can_clk is %d", *can_clk);

	return ret;
}

bool STM32_fdcan_tx::init()
{
	freertos_util::logging::Logger* const logger = freertos_util::logging::Global_logger::get();
	using freertos_util::logging::LOG_LEVEL;

	logger->log(LOG_LEVEL::DEBUG, "STM32_fdcan_tx::init", "");

	HAL_StatusTypeDef ret = HAL_OK;

	//TODO: store the baud rate and always reconfigure it here
	*m_fdcan_handle = FDCAN_HandleTypeDef();

	m_fdcan_handle->Instance = m_fdcan;

	{
		std::unique_lock<Mutex_static_recursive> config_lock;
		const CAN_USB_app_config::Config_Set& m_config = can_usb_app.get_config(&config_lock);

		//classic, no brs, brs
		logger->log(LOG_LEVEL::TRACE, "STM32_fdcan_tx::init", "protocol");
		if(m_config.protocol_fd)
		{
			if(m_config.protocol_brs)
			{
				m_fdcan_handle->Init.FrameFormat = FDCAN_FRAME_FD_BRS;
			}
			else
			{
				m_fdcan_handle->Init.FrameFormat = FDCAN_FRAME_FD_NO_BRS;
			}
		}
		else
		{
			m_fdcan_handle->Init.FrameFormat = FDCAN_FRAME_CLASSIC;
		}
		
		if(m_config.listen_only)
		{
			m_fdcan_handle->Init.Mode = FDCAN_MODE_BUS_MONITORING;
		}
		else
		{
			m_fdcan_handle->Init.Mode = FDCAN_MODE_NORMAL;
		}

		m_fdcan_handle->Init.AutoRetransmission = ENABLE;
		m_fdcan_handle->Init.TransmitPause = DISABLE;
		m_fdcan_handle->Init.ProtocolException = ENABLE;

		//handle the slew rate control based on the setting and baud rate
		logger->log(LOG_LEVEL::TRACE, "STM32_fdcan_tx::init", "slope_ctrl");
		switch(m_config.slope_ctrl)
		{
			case CAN_USB_app_config::SLOPE_CONTROL::SLOW:
			{
				set_can_slew_slow();
				break;
			}
			case CAN_USB_app_config::SLOPE_CONTROL::FAST:
			{
				set_can_slew_high();
				break;
			}
			default:
			{
				logger->log(LOG_LEVEL::WARN, "STM32_fdcan_tx::init", "slope control setting corrupt, setting to auto");
				//fall through here
			}
			case CAN_USB_app_config::SLOPE_CONTROL::AUTO:
			{
				if(m_config.protocol_brs)
				{
					if((m_config.bitrate_nominal > 500000) || (m_config.bitrate_data > 500000))
					{
						set_can_slew_high();
					}
					else
					{
						set_can_slew_slow();
					}
				}
				else
				{
					if(m_config.bitrate_nominal > 500000)
					{
						set_can_slew_high();
					}
					else
					{
						set_can_slew_slow();
					}
				}
				break;
			}
		}

