suburbanembedded/hadoucan-fw/hadoucan-fw/src/STM32_fdcan_tx.cpp
		logger->log(LOG_LEVEL::TRACE, "STM32_fdcan_tx::init", "set clock");
		uint32_t current_can_clk = 0;
		get_can_clk(&current_can_clk);
		if(current_can_clk != m_config.can_clock)
		{
			if(!set_can_clk(m_config.can_clock))
			{
				logger->log(LOG_LEVEL::ERROR, "STM32_fdcan_tx::init", "set_can_clk failed");
				return false;
			}
		}

		logger->log(LOG_LEVEL::TRACE, "STM32_fdcan_tx::init", "set baud");
		if(!set_baud(m_config.bitrate_nominal, m_config.bitrate_data))
		{
			logger->log(LOG_LEVEL::ERROR, "STM32_fdcan_tx::init", "set_baud failed");
			return false;
		}
	}

	m_fdcan_handle->Init.MessageRAMOffset = 0;
	m_fdcan_handle->Init.StdFiltersNbr = 2; // 1 word
	m_fdcan_handle->Init.ExtFiltersNbr = 2; // 2 word
	m_fdcan_handle->Init.RxFifo0ElmtsNbr = 64;
	m_fdcan_handle->Init.RxFifo0ElmtSize = FDCAN_DATA_BYTES_64;
	m_fdcan_handle->Init.RxFifo1ElmtsNbr = 0;
	m_fdcan_handle->Init.RxFifo1ElmtSize = FDCAN_DATA_BYTES_64;
	m_fdcan_handle->Init.RxBuffersNbr = 0;

	m_fdcan_handle->Init.TxEventsNbr = 0;
	m_fdcan_handle->Init.TxBuffersNbr = 0;
	m_fdcan_handle->Init.TxFifoQueueElmtsNbr = 32;
	m_fdcan_handle->Init.TxFifoQueueMode = FDCAN_TX_FIFO_OPERATION;
	m_fdcan_handle->Init.TxElmtSize = FDCAN_DATA_BYTES_64;

	// STD filter - 1 word - 128x1
	// EXT filter - 2 word - 64x2
	// RX frame  - 18 word - 64x18 = 1152 word max
	// TX frame  - 18 word - 32x18 = 576 word max
	// 2560 max = 64x RX, 32x Tx, 2x STD, 2x EXT = 1152+576+2+4 = 1734

	logger->log(LOG_LEVEL::TRACE, "STM32_fdcan_tx::init", "HAL_FDCAN_Init");
	ret = HAL_FDCAN_Init(m_fdcan_handle);
	if(ret != HAL_OK)
	{
		logger->log(LOG_LEVEL::ERROR, "STM32_fdcan_tx::init", "HAL_FDCAN_Init failed");
		return false;
	}

	//bypass clock calibration
	// fdcan_ker_ck = 60MHz
	// fdcan_tq_ck  = fdcan_ker_ck / 1
	logger->log(LOG_LEVEL::TRACE, "STM32_fdcan_tx::init", "HAL_FDCAN_ConfigClockCalibration");
	FDCAN_ClkCalUnitTypeDef cal_config = FDCAN_ClkCalUnitTypeDef();
	cal_config.ClockCalibration = DISABLE;
	cal_config.ClockDivider = FDCAN_CLOCK_DIV1;
	ret = HAL_FDCAN_ConfigClockCalibration(m_fdcan_handle, &cal_config);
	if(ret != HAL_OK)
	{
		logger->log(LOG_LEVEL::ERROR, "STM32_fdcan_tx::init", "HAL_FDCAN_ConfigClockCalibration failed");
		return false;
	}

	//units of mtq - fdcan_tq_ck - 60MHz -> 16 2/3 ns
	//ADM3055E - TXD->BUS R->D 35 - 60ns
	//ADM3055E - TXD->BUS D->E 46 - 70ns
	//ADM3055E - TXD->RXD Falling 150ns full, 300ns slope ctrl
	//ADM3055E - TXD->RXD Rising 150ns full, 300ns slope ctrl
	//150ns is 9 mtq
	logger->log(LOG_LEVEL::TRACE, "STM32_fdcan_tx::init", "HAL_FDCAN_ConfigTxDelayCompensation");
	ret = HAL_FDCAN_ConfigTxDelayCompensation(m_fdcan_handle, 5, 0);
	if(ret != HAL_OK)
	{
		logger->log(LOG_LEVEL::ERROR, "STM32_fdcan_tx::init", "HAL_FDCAN_ConfigTxDelayCompensation failed");
		return false;
	}
	logger->log(LOG_LEVEL::TRACE, "STM32_fdcan_tx::init", "HAL_FDCAN_EnableTxDelayCompensation");
	ret = HAL_FDCAN_EnableTxDelayCompensation(m_fdcan_handle);
	if(ret != HAL_OK)
	{
		logger->log(LOG_LEVEL::ERROR, "STM32_fdcan_tx::init", "HAL_FDCAN_EnableTxDelayCompensation failed");
		return false;
	}

	logger->log(LOG_LEVEL::TRACE, "STM32_fdcan_tx::init", "HAL_FDCAN_GetErrorCounters");
	FDCAN_ErrorCountersTypeDef error_counters;
	ret = HAL_FDCAN_GetErrorCounters(m_fdcan_handle, &error_counters);
	if(ret != HAL_OK)
	{
		logger->log(LOG_LEVEL::ERROR, "STM32_fdcan_tx::init", "HAL_FDCAN_GetErrorCounters failed");
		return false;
	}

	logger->log(LOG_LEVEL::TRACE, "STM32_fdcan_tx::init", "HAL_FDCAN_ConfigTimestampCounter");
	ret = HAL_FDCAN_ConfigTimestampCounter(m_fdcan_handle, FDCAN_TIMESTAMP_PRESC_1);
	if(ret != HAL_OK)
	{
		logger->log(LOG_LEVEL::ERROR, "STM32_fdcan_tx::init", "HAL_FDCAN_ConfigTimestampCounter failed");
		return false;
	}

	logger->log(LOG_LEVEL::TRACE, "STM32_fdcan_tx::init", "HAL_FDCAN_EnableTimestampCounter");
	HAL_FDCAN_EnableTimestampCounter(m_fdcan_handle, FDCAN_TIMESTAMP_EXTERNAL);
	if(ret != HAL_OK)
	{
		logger->log(LOG_LEVEL::ERROR, "STM32_fdcan_tx::init", "HAL_FDCAN_EnableTimestampCounter failed");
		return false;
	}

	FDCAN_FilterTypeDef sFilter0_std;
	sFilter0_std.IdType           = FDCAN_STANDARD_ID;
	sFilter0_std.FilterIndex      = 0;
	sFilter0_std.FilterType       = FDCAN_FILTER_MASK;
	sFilter0_std.FilterConfig     = FDCAN_FILTER_DISABLE;
	sFilter0_std.FilterID1        = 0;
	sFilter0_std.FilterID2        = 0;
	sFilter0_std.RxBufferIndex    = 0;
	sFilter0_std.IsCalibrationMsg = 0;

	FDCAN_FilterTypeDef sFilter1_std;
	sFilter1_std.IdType           = FDCAN_STANDARD_ID;
	sFilter1_std.FilterIndex      = 1;
	sFilter1_std.FilterType       = FDCAN_FILTER_MASK;
	sFilter1_std.FilterConfig     = FDCAN_FILTER_DISABLE;
	sFilter1_std.FilterID1        = 0;
	sFilter1_std.FilterID2        = 0;
	sFilter1_std.RxBufferIndex    = 0;
	sFilter1_std.IsCalibrationMsg = 0;

	FDCAN_FilterTypeDef sFilter0_ext;
	sFilter0_ext.IdType           = FDCAN_EXTENDED_ID;
	sFilter0_ext.FilterIndex      = 0;
	sFilter0_ext.FilterType       = FDCAN_FILTER_MASK;
	sFilter0_ext.FilterConfig     = FDCAN_FILTER_DISABLE;
	sFilter0_ext.FilterID1        = 0;
	sFilter0_ext.FilterID2        = 0;
	sFilter0_ext.RxBufferIndex    = 0;
	sFilter0_ext.IsCalibrationMsg = 0;

	FDCAN_FilterTypeDef sFilter1_ext;
	sFilter1_ext.IdType           = FDCAN_EXTENDED_ID;
	sFilter1_ext.FilterIndex      = 1;
	sFilter1_ext.FilterType       = FDCAN_FILTER_MASK;
	sFilter1_ext.FilterConfig     = FDCAN_FILTER_DISABLE;
	sFilter1_ext.FilterID1        = 0;
	sFilter1_ext.FilterID2        = 0;
	sFilter1_ext.RxBufferIndex    = 0;
	sFilter1_ext.IsCalibrationMsg = 0;

	uint32_t std_allow_rtr = FDCAN_FILTER_REMOTE;
	uint32_t ext_allow_rtr = FDCAN_FILTER_REMOTE;

	{
		std::unique_lock<Mutex_static_recursive> config_lock;
		const CAN_USB_app_config::Config_Set& m_config = can_usb_app.get_config(&config_lock);

		if(m_config.sja1000_filter.is_enabled())
		{
			// FDCAN_FILTER_RANGE         /*!< Range filter from FilterID1 to FilterID2                        */
			// FDCAN_FILTER_DUAL          /*!< Dual ID filter for FilterID1 or FilterID2                       */
			// FDCAN_FILTER_MASK          /*!< Classic filter: FilterID1 = filter, FilterID2 = mask            */
			// FDCAN_FILTER_RANGE_NO_EIDM /*!< Range filter from FilterID1 to FilterID2, EIDM mask not applied */

			switch(m_config.sja1000_filter.get_filter_mode())
			{
				case SJA1000_filter::FILTER_MODE::DUAL:
				{
					//create two traditional id+mask filters
					sFilter0_std.FilterConfig = FDCAN_FILTER_TO_RXFIFO0;
					sFilter0_std.FilterID1  = m_config.sja1000_filter.get_std_id1_code();
					sFilter0_std.FilterID2  = m_config.sja1000_filter.get_std_id1_mask();

					sFilter1_std.FilterConfig = FDCAN_FILTER_TO_RXFIFO0;
					sFilter1_std.FilterID1  = m_config.sja1000_filter.get_std_id2_code();
					sFilter1_std.FilterID2  = m_config.sja1000_filter.get_std_id2_mask();

