suburbanembedded/hadoucan-fw/hadoucan-fw/src/STM32_fdcan_tx.cpp
					sFilter0_ext.FilterConfig = FDCAN_FILTER_TO_RXFIFO0;
					sFilter0_ext.FilterID1  = m_config.sja1000_filter.get_ext_id1_code();
					sFilter0_ext.FilterID2  = m_config.sja1000_filter.get_ext_id1_mask();

					sFilter1_ext.FilterConfig = FDCAN_FILTER_TO_RXFIFO0;
					sFilter1_ext.FilterID1  = m_config.sja1000_filter.get_ext_id2_code();
					sFilter1_ext.FilterID2  = m_config.sja1000_filter.get_ext_id2_mask();
					
					std_allow_rtr  = (m_config.sja1000_filter.accept_std_rtr1() || m_config.sja1000_filter.accept_std_rtr2()) ? (FDCAN_FILTER_REMOTE) : (FDCAN_REJECT_REMOTE);
					ext_allow_rtr  = (m_config.sja1000_filter.accept_ext_rtr1() || m_config.sja1000_filter.accept_ext_rtr2()) ? (FDCAN_FILTER_REMOTE) : (FDCAN_REJECT_REMOTE);
					break;
				}
				case SJA1000_filter::FILTER_MODE::SINGLE:
				{
					sFilter0_std.FilterConfig = FDCAN_FILTER_TO_RXFIFO0;
					sFilter0_std.FilterID1  = m_config.sja1000_filter.get_std_id_code();
					sFilter0_std.FilterID2  = m_config.sja1000_filter.get_std_id_mask();

					sFilter0_ext.FilterConfig = FDCAN_FILTER_TO_RXFIFO0;
					sFilter0_ext.FilterID1  = m_config.sja1000_filter.get_ext_id_code();
					sFilter0_ext.FilterID2  = m_config.sja1000_filter.get_ext_id_mask();
					
					std_allow_rtr  = (m_config.sja1000_filter.accept_std_rtr()) ? (FDCAN_FILTER_REMOTE) : (FDCAN_REJECT_REMOTE);
					ext_allow_rtr  = (m_config.sja1000_filter.accept_ext_rtr()) ? (FDCAN_FILTER_REMOTE) : (FDCAN_REJECT_REMOTE);
					break;
				}
				default:
				{
					logger->log(LOG_LEVEL::ERROR, "STM32_fdcan_tx::init", "sja1000_filter.mode invalid");
					return false;
				}
			}
		}
		else
		{
			//default to accept all
			sFilter0_std.FilterConfig = FDCAN_FILTER_TO_RXFIFO0;
			sFilter0_std.FilterID1    = 0x000;//filter
			sFilter0_std.FilterID2    = 0x000;//mask none, match all
			std_allow_rtr             = FDCAN_FILTER_REMOTE;
		
			//default to accept all
			sFilter0_ext.FilterConfig = FDCAN_FILTER_TO_RXFIFO0;
			sFilter0_ext.FilterID1    = 0x00000000;//filter
			sFilter0_ext.FilterID2    = 0x00000000;//mask none, match all
			ext_allow_rtr             = FDCAN_FILTER_REMOTE;
		}
	}

	// Configure Rx Std filter
	logger->log(LOG_LEVEL::TRACE, "STM32_fdcan_tx::init", "HAL_FDCAN_ConfigFilter RX STD 0");
	ret = HAL_FDCAN_ConfigFilter(m_fdcan_handle, &sFilter0_std);
	if(ret != HAL_OK)
	{
		logger->log(LOG_LEVEL::ERROR, "STM32_fdcan_tx::init", "HAL_FDCAN_ConfigFilter failed");
		return false;
	}
	logger->log(LOG_LEVEL::TRACE, "STM32_fdcan_tx::init", "HAL_FDCAN_ConfigFilter RX STD 1");
	ret = HAL_FDCAN_ConfigFilter(m_fdcan_handle, &sFilter1_std);
	if(ret != HAL_OK)
	{
		logger->log(LOG_LEVEL::ERROR, "STM32_fdcan_tx::init", "HAL_FDCAN_ConfigFilter failed");
		return false;
	}

	// Configure Rx Ext filter
	logger->log(LOG_LEVEL::TRACE, "STM32_fdcan_tx::init", "HAL_FDCAN_ConfigFilter RX EXT 0");
	ret = HAL_FDCAN_ConfigFilter(m_fdcan_handle, &sFilter0_ext);
	if(ret != HAL_OK)
	{
		logger->log(LOG_LEVEL::ERROR, "STM32_fdcan_tx::init", "HAL_FDCAN_ConfigFilter failed");
		return false;
	}
	logger->log(LOG_LEVEL::TRACE, "STM32_fdcan_tx::init", "HAL_FDCAN_ConfigFilter RX EXT 1");
	ret = HAL_FDCAN_ConfigFilter(m_fdcan_handle, &sFilter1_ext);
	if(ret != HAL_OK)
	{
		logger->log(LOG_LEVEL::ERROR, "STM32_fdcan_tx::init", "HAL_FDCAN_ConfigFilter failed");
		return false;
	}

	unsigned can_rx_isr_watermark = 16;
	{
		std::unique_lock<Mutex_static_recursive> lock;
		can_rx_isr_watermark = can_usb_app.get_config(&lock).can_rx_isr_watermark;
	}

	logger->log(LOG_LEVEL::TRACE, "STM32_fdcan_tx::init", "HAL_FDCAN_ConfigFifoWatermark");
	ret = HAL_FDCAN_ConfigFifoWatermark(m_fdcan_handle, FDCAN_CFG_RX_FIFO0, can_rx_isr_watermark);
	if(ret != HAL_OK)
	{
		logger->log(LOG_LEVEL::ERROR, "STM32_fdcan_tx::init", "HAL_FDCAN_ConfigFifoWatermark for FIFO0 failed");
		return false;
	}

	logger->log(LOG_LEVEL::TRACE, "STM32_fdcan_tx::init", "HAL_FDCAN_ConfigRxFifoOverwrite");
	ret = HAL_FDCAN_ConfigRxFifoOverwrite(m_fdcan_handle, FDCAN_CFG_RX_FIFO0, FDCAN_RX_FIFO_OVERWRITE);
	if(ret != HAL_OK)
	{
		logger->log(LOG_LEVEL::ERROR, "STM32_fdcan_tx::init", "HAL_FDCAN_ConfigRxFifoOverwrite for FIFO0 failed");
		return false;
	}

	logger->log(LOG_LEVEL::TRACE, "STM32_fdcan_tx::init", "HAL_FDCAN_ActivateNotification");
	ret = HAL_FDCAN_ActivateNotification(m_fdcan_handle, FDCAN_IT_RX_FIFO0_WATERMARK | FDCAN_IT_RX_FIFO0_FULL | FDCAN_IT_RX_FIFO0_MESSAGE_LOST, 0);
	if(ret != HAL_OK)
	{
		logger->log(LOG_LEVEL::ERROR, "STM32_fdcan_tx::init", "HAL_FDCAN_ActivateNotification for FIFO0 failed");
		return false;
	}

	// ret = HAL_FDCAN_ConfigFifoWatermark(m_fdcan_handle, FDCAN_CFG_RX_FIFO1, 2);
	// if(ret != HAL_OK)
	// {
	// 	logger->log(LOG_LEVEL::ERROR, "STM32_fdcan_tx::init", "HAL_FDCAN_ConfigFifoWatermark for FIFO1 failed");
	// 	return false;
	// }

	// ret = HAL_FDCAN_ConfigRxFifoOverwrite(m_fdcan_handle, FDCAN_CFG_RX_FIFO1, FDCAN_RX_FIFO_OVERWRITE);
	// if(ret != HAL_OK)
	// {
	// 	logger->log(LOG_LEVEL::ERROR, "STM32_fdcan_tx::init", "HAL_FDCAN_ConfigRxFifoOverwrite for FIFO1 failed");
	// 	return false;
	// }

	// ret = HAL_FDCAN_ActivateNotification(m_fdcan_handle, FDCAN_IT_RX_FIFO1_WATERMARK | FDCAN_IT_RX_FIFO1_FULL | FDCAN_IT_RX_FIFO1_MESSAGE_LOST, 0);
	// ret = HAL_FDCAN_ActivateNotification(m_fdcan_handle, FDCAN_IT_RX_FIFO1_WATERMARK, 0);
	// if(ret != HAL_OK)
	// {
	// 	logger->log(LOG_LEVEL::ERROR, "STM32_fdcan_tx::init", "HAL_FDCAN_ActivateNotification for FIFO1 failed");
	// 	return false;
	// }

	// ret = HAL_FDCAN_ConfigGlobalFilter(m_fdcan_handle, FDCAN_ACCEPT_IN_RX_FIFO0, FDCAN_ACCEPT_IN_RX_FIFO1, DISABLE, DISABLE);
	//reject all non-matching frames
	logger->log(LOG_LEVEL::TRACE, "STM32_fdcan_tx::init", "HAL_FDCAN_ConfigGlobalFilter");
	//uint32_t NonMatchingStd, uint32_t NonMatchingExt, uint32_t RejectRemoteStd, uint32_t RejectRemoteExt
	ret = HAL_FDCAN_ConfigGlobalFilter(m_fdcan_handle, FDCAN_REJECT, FDCAN_REJECT, std_allow_rtr, ext_allow_rtr);
	if(ret != HAL_OK)
	{
		logger->log(LOG_LEVEL::ERROR, "STM32_fdcan_tx::init", "HAL_FDCAN_ConfigGlobalFilter failed");
		return false;
	}

	{
		bool fd_iso_mode = true;
		{
			std::unique_lock<Mutex_static_recursive> config_lock;
			const CAN_USB_app_config::Config_Set& m_config = can_usb_app.get_config(&config_lock);

			fd_iso_mode = m_config.protocol_fd_iso;
		}

		if(fd_iso_mode)
		{
			logger->log(LOG_LEVEL::DEBUG, "STM32_fdcan_tx::init", "ISO FD mode requested");
			ret = HAL_FDCAN_EnableISOMode(m_fdcan_handle);
			if(ret != HAL_OK)
			{
				logger->log(LOG_LEVEL::ERROR, "STM32_fdcan_tx::init", "HAL_FDCAN_EnableISOMode failed");
				return false;
			}
		}
		else
		{
			logger->log(LOG_LEVEL::DEBUG, "STM32_fdcan_tx::init", "Non-ISO FD mode requested");
			ret = HAL_FDCAN_DisableISOMode(m_fdcan_handle);
			if(ret != HAL_OK)
			{
				logger->log(LOG_LEVEL::ERROR, "STM32_fdcan_tx::init", "HAL_FDCAN_DisableISOMode failed");
				return false;
			}
		}
	}

