suburbanembedded/hadoucan-fw/hadoucan-fw/src/STM32_fdcan_tx.cpp
	return true;
}

bool STM32_fdcan_tx::set_baud(const int std_baud)
{
	freertos_util::logging::Logger* const logger = freertos_util::logging::Global_logger::get();
	using freertos_util::logging::LOG_LEVEL;

	CAN_USB_app_bitrate_table::Bitrate_Table_Entry nominal_entry;

	{
		std::unique_lock<Mutex_static_recursive> config_lock;
		const CAN_USB_app_config::Config_Set& m_config = can_usb_app.get_config(&config_lock);
		
		std::unique_lock<Mutex_static_recursive> bitrate_table_lock;
		const CAN_USB_app_bitrate_table& m_bitrate_table = can_usb_app.get_bitrate_tables(&bitrate_table_lock);

		if(!m_bitrate_table.get_nominal_entry(m_config.can_clock, std_baud, &nominal_entry))
		{
			logger->log(LOG_LEVEL::ERROR, "STM32_fdcan_tx::set_baud", "m_bitrate_table.get_nominal_entry failed, clock: %d, baud: %d", m_config.can_clock, std_baud);
			return false;
		}
	}

	return set_baud(nominal_entry, m_fdcan_handle);
}

bool STM32_fdcan_tx::set_baud(const CAN_USB_app_bitrate_table::Bitrate_Table_Entry& std_baud, FDCAN_HandleTypeDef* const handle)
{
	freertos_util::logging::Logger* const logger = freertos_util::logging::Global_logger::get();
	using freertos_util::logging::LOG_LEVEL;

	handle->Init.NominalPrescaler = std_baud.pre;      //1-512
	handle->Init.NominalSyncJumpWidth = std_baud.sjw;  //1-128
	handle->Init.NominalTimeSeg1 = std_baud.tseg1;     //1-256 
	handle->Init.NominalTimeSeg2 = std_baud.tseg2;     //1-128

	logger->log(LOG_LEVEL::DEBUG, "STM32_fdcan_tx::set_baud", "NominalPrescaler: %d", std_baud.pre);
	logger->log(LOG_LEVEL::DEBUG, "STM32_fdcan_tx::set_baud", "NominalSyncJumpWidth: %d", std_baud.sjw);
	logger->log(LOG_LEVEL::DEBUG, "STM32_fdcan_tx::set_baud", "NominalTimeSeg1: %d", std_baud.tseg1);
	logger->log(LOG_LEVEL::DEBUG, "STM32_fdcan_tx::set_baud", "NominalTimeSeg2: %d", std_baud.tseg2);

	return true;
}

bool STM32_fdcan_tx::set_baud(const int std_baud, const int fd_baud)
{
	freertos_util::logging::Logger* const logger = freertos_util::logging::Global_logger::get();
	using freertos_util::logging::LOG_LEVEL;

	CAN_USB_app_bitrate_table::Bitrate_Table_Entry nominal_entry;
	CAN_USB_app_bitrate_table::Bitrate_Table_Entry data_entry;

	{
		std::unique_lock<Mutex_static_recursive> config_lock;
		const CAN_USB_app_config::Config_Set& m_config = can_usb_app.get_config(&config_lock);
		
		std::unique_lock<Mutex_static_recursive> bitrate_table_lock;
		const CAN_USB_app_bitrate_table& m_bitrate_table = can_usb_app.get_bitrate_tables(&bitrate_table_lock);

		if(!m_bitrate_table.get_nominal_entry(m_config.can_clock, std_baud, &nominal_entry))
		{
			logger->log(LOG_LEVEL::ERROR, "STM32_fdcan_tx::set_baud", "m_bitrate_table.get_nominal_entry failed, clock: %d, baud: %d", m_config.can_clock, std_baud);
			return false;	
		}

		if(!m_bitrate_table.get_data_entry(m_config.can_clock, fd_baud, &data_entry))
		{
			logger->log(LOG_LEVEL::ERROR, "STM32_fdcan_tx::set_baud", "m_bitrate_table.get_data_entry failed, clock: %d, baud: %d", m_config.can_clock, fd_baud);
			return false;
		}
	}

	return set_baud(nominal_entry, data_entry, m_fdcan_handle);
}
bool STM32_fdcan_tx::set_baud(const CAN_USB_app_bitrate_table::Bitrate_Table_Entry& std_baud, const CAN_USB_app_bitrate_table::Bitrate_Table_Entry& fd_baud, FDCAN_HandleTypeDef* const handle)
{
	freertos_util::logging::Logger* const logger = freertos_util::logging::Global_logger::get();
	using freertos_util::logging::LOG_LEVEL;

	handle->Init.NominalPrescaler = std_baud.pre;      //1-512
	handle->Init.NominalSyncJumpWidth = std_baud.sjw;  //1-128
	handle->Init.NominalTimeSeg1 = std_baud.tseg1;     //1-256 
	handle->Init.NominalTimeSeg2 = std_baud.tseg2;     //1-128

	handle->Init.DataPrescaler = fd_baud.pre;      //1-32
	handle->Init.DataSyncJumpWidth = fd_baud.sjw;  //1-16
	handle->Init.DataTimeSeg1 = fd_baud.tseg1;     //1-32 
	handle->Init.DataTimeSeg2 = fd_baud.tseg2;     //1-16

	logger->log(LOG_LEVEL::DEBUG, "STM32_fdcan_tx::set_baud", "NominalPrescaler: %d", std_baud.pre);
	logger->log(LOG_LEVEL::DEBUG, "STM32_fdcan_tx::set_baud", "NominalSyncJumpWidth: %d", std_baud.sjw);
	logger->log(LOG_LEVEL::DEBUG, "STM32_fdcan_tx::set_baud", "NominalTimeSeg1: %d", std_baud.tseg1);
	logger->log(LOG_LEVEL::DEBUG, "STM32_fdcan_tx::set_baud", "NominalTimeSeg2: %d", std_baud.tseg2);

	logger->log(LOG_LEVEL::DEBUG, "STM32_fdcan_tx::set_baud", "DataPrescaler: %d", fd_baud.pre);
	logger->log(LOG_LEVEL::DEBUG, "STM32_fdcan_tx::set_baud", "DataSyncJumpWidth: %d", fd_baud.sjw);
	logger->log(LOG_LEVEL::DEBUG, "STM32_fdcan_tx::set_baud", "DataTimeSeg1: %d", fd_baud.tseg1);
	logger->log(LOG_LEVEL::DEBUG, "STM32_fdcan_tx::set_baud", "DataTimeSeg2: %d", fd_baud.tseg2);

	return true;
}

bool STM32_fdcan_tx::open()
{
	freertos_util::logging::Logger* const logger = freertos_util::logging::Global_logger::get();
	using freertos_util::logging::LOG_LEVEL;

	logger->log(LOG_LEVEL::DEBUG, "STM32_fdcan_tx::open", "");

	HAL_StatusTypeDef ret = HAL_OK;

	logger->log(LOG_LEVEL::TRACE, "STM32_fdcan_tx::open", "init");
	if(!init())
	{
		logger->log(LOG_LEVEL::ERROR, "STM32_fdcan_tx::open", "STM32_fdcan_tx::init failed");
		return false;
	}

	logger->log(LOG_LEVEL::TRACE, "STM32_fdcan_tx::open", "start");
	ret = HAL_FDCAN_Start(m_fdcan_handle);
	if(ret != HAL_OK)
	{
		logger->log(LOG_LEVEL::ERROR, "STM32_fdcan_tx::open", "HAL_FDCAN_Start failed");
		return false;
	}

	logger->log(LOG_LEVEL::TRACE, "STM32_fdcan_tx::open", "mode");
	if(HAL_FDCAN_IsRestrictedOperationMode(m_fdcan_handle))
	{
		logger->log(LOG_LEVEL::ERROR, "STM32_fdcan_tx::open", "FDCAN is in Restricted Mode");
		return false;	
	}

	logger->log(LOG_LEVEL::INFO, "STM32_fdcan_tx::open", "CAN is open");
	m_is_open = true;

	return true;
}
bool STM32_fdcan_tx::close()
{
	freertos_util::logging::Logger* const logger = freertos_util::logging::Global_logger::get();
	using freertos_util::logging::LOG_LEVEL;

	logger->log(LOG_LEVEL::DEBUG, "STM32_fdcan_tx::close", "");

	// if(HAL_FDCAN_DeactivateNotification(m_fdcan_handle, FDCAN_IT_RX_FIFO0_WATERMARK | FDCAN_IT_RX_FIFO0_FULL | FDCAN_IT_RX_FIFO0_MESSAGE_LOST) != HAL_OK)
	if(HAL_FDCAN_DeactivateNotification(m_fdcan_handle, FDCAN_IT_RX_FIFO0_WATERMARK) != HAL_OK)
	{
		logger->log(LOG_LEVEL::ERROR, "STM32_fdcan_tx::close", "HAL_FDCAN_DeactivateNotification for FIFO0 failed");
		return false;	
	}
/*
	// if(HAL_FDCAN_DeactivateNotification(m_fdcan_handle, FDCAN_IT_RX_FIFO1_WATERMARK | FDCAN_IT_RX_FIFO1_FULL | FDCAN_IT_RX_FIFO1_MESSAGE_LOST) != HAL_OK)
	if(HAL_FDCAN_DeactivateNotification(m_fdcan_handle, FDCAN_IT_RX_FIFO1_WATERMARK) != HAL_OK)
	{
		logger->log(LOG_LEVEL::ERROR, "STM32_fdcan_tx::close", "HAL_FDCAN_DeactivateNotification for FIFO1 failed");
		return false;	
	}
*/
	if(HAL_FDCAN_Stop(m_fdcan_handle) != HAL_OK)
	{
		return false;
	}

	logger->log(LOG_LEVEL::INFO, "STM32_fdcan_tx::open", "CAN is closed");
	m_is_open = false;

