suburbanembedded/hadoucan-fw/hadoucan-fw/src/STM32_fdcan_tx.cpp
	return true;
}

bool STM32_fdcan_tx::tx_std(const uint32_t id, const uint8_t data_len, const uint8_t* data)
{
	freertos_util::logging::Logger* const logger = freertos_util::logging::Global_logger::get();
	using freertos_util::logging::LOG_LEVEL;

	logger->log(LOG_LEVEL::TRACE, "STM32_fdcan_tx::tx_std", "");

	if(!m_is_open)
	{
		logger->log(LOG_LEVEL::WARN, "STM32_fdcan_tx::tx_std", "Tried to send with closed interface");
		return false;
	}

	STM32_FDCAN_DLC dlc;
	if(!dlc.from_len(data_len))
	{
		return false;
	}

	FDCAN_TxHeaderTypeDef tx_head;

	tx_head.Identifier = id;
	tx_head.IdType = FDCAN_STANDARD_ID;
	tx_head.TxFrameType = FDCAN_DATA_FRAME;
	tx_head.DataLength = dlc.get_fdcan_dlc();
	tx_head.ErrorStateIndicator = FDCAN_ESI_ACTIVE;
	tx_head.BitRateSwitch = FDCAN_BRS_OFF;
	tx_head.FDFormat = FDCAN_CLASSIC_CAN;
	tx_head.TxEventFifoControl = FDCAN_NO_TX_EVENTS;
	tx_head.MessageMarker = 0;

	std::array<uint8_t, 8> out_data;
	std::copy_n(data, data_len, out_data.begin());

	return send_packet(tx_head, out_data.data());
}

bool STM32_fdcan_tx::tx_ext(const uint32_t id, const uint8_t data_len, const uint8_t* data)
{
	freertos_util::logging::Logger* const logger = freertos_util::logging::Global_logger::get();
	using freertos_util::logging::LOG_LEVEL;

	logger->log(LOG_LEVEL::TRACE, "STM32_fdcan_tx::tx_ext", "");

	if(!m_is_open)
	{
		logger->log(LOG_LEVEL::WARN, "STM32_fdcan_tx::tx_ext", "Tried to send with closed interface");
		return false;
	}

	STM32_FDCAN_DLC dlc;
	if(!dlc.from_len(data_len))
	{
		return false;
	}

	FDCAN_TxHeaderTypeDef tx_head;

	tx_head.Identifier = id;
	tx_head.IdType = FDCAN_EXTENDED_ID;
	tx_head.TxFrameType = FDCAN_DATA_FRAME;
	tx_head.DataLength = dlc.get_fdcan_dlc();
	tx_head.ErrorStateIndicator = FDCAN_ESI_ACTIVE;
	tx_head.BitRateSwitch = FDCAN_BRS_OFF;
	tx_head.FDFormat = FDCAN_CLASSIC_CAN;
	tx_head.TxEventFifoControl = FDCAN_NO_TX_EVENTS;
	tx_head.MessageMarker = 0;

	std::array<uint8_t, 8> out_data;
	std::copy_n(data, data_len, out_data.begin());

	return send_packet(tx_head, out_data.data());
}

bool STM32_fdcan_tx::tx_std_rtr(const uint32_t id, const uint8_t data_len)
{
	freertos_util::logging::Logger* const logger = freertos_util::logging::Global_logger::get();
	using freertos_util::logging::LOG_LEVEL;

	logger->log(LOG_LEVEL::TRACE, "STM32_fdcan_tx::tx_std_rtr", "");

	if(!m_is_open)
	{
		logger->log(LOG_LEVEL::WARN, "STM32_fdcan_tx::tx_std_rtr", "Tried to send with closed interface");
		return false;
	}

	STM32_FDCAN_DLC dlc;
	if(!dlc.from_len(data_len))
	{
		return false;
	}

	FDCAN_TxHeaderTypeDef tx_head;

	tx_head.Identifier = id;
	tx_head.IdType = FDCAN_STANDARD_ID;
	tx_head.TxFrameType = FDCAN_REMOTE_FRAME;
	tx_head.DataLength = dlc.get_fdcan_dlc();
	tx_head.ErrorStateIndicator = FDCAN_ESI_ACTIVE;
	tx_head.BitRateSwitch = FDCAN_BRS_OFF;
	tx_head.FDFormat = FDCAN_CLASSIC_CAN;
	tx_head.TxEventFifoControl = FDCAN_NO_TX_EVENTS;
	tx_head.MessageMarker = 0;

	return send_packet(tx_head, nullptr);
}
bool STM32_fdcan_tx::tx_ext_rtr(const uint32_t id, const uint8_t data_len)
{
	freertos_util::logging::Logger* const logger = freertos_util::logging::Global_logger::get();
	using freertos_util::logging::LOG_LEVEL;

	logger->log(LOG_LEVEL::TRACE, "STM32_fdcan_tx::tx_ext_rtr", "");

	if(!m_is_open)
	{
		logger->log(LOG_LEVEL::WARN, "STM32_fdcan_tx::tx_ext_rtr", "Tried to send with closed interface");
		return false;
	}

	STM32_FDCAN_DLC dlc;
	if(!dlc.from_len(data_len))
	{
		return false;
	}

	FDCAN_TxHeaderTypeDef tx_head;

	tx_head.Identifier = id;
	tx_head.IdType = FDCAN_EXTENDED_ID;
	tx_head.TxFrameType = FDCAN_REMOTE_FRAME;
	tx_head.DataLength = dlc.get_fdcan_dlc();
	tx_head.ErrorStateIndicator = FDCAN_ESI_ACTIVE;
	tx_head.BitRateSwitch = FDCAN_BRS_OFF;
	tx_head.FDFormat = FDCAN_CLASSIC_CAN;
	tx_head.TxEventFifoControl = FDCAN_NO_TX_EVENTS;
	tx_head.MessageMarker = 0;

	return send_packet(tx_head, nullptr);
}

bool STM32_fdcan_tx::tx_fd_std(const uint32_t id, const BRS brs, const ESI esi, const uint8_t data_len, const uint8_t* data)
{
	freertos_util::logging::Logger* const logger = freertos_util::logging::Global_logger::get();
	using freertos_util::logging::LOG_LEVEL;

	logger->log(LOG_LEVEL::TRACE, "STM32_fdcan_tx::tx_fd_std", "");

	if(!m_is_open)
	{
		logger->log(LOG_LEVEL::WARN, "STM32_fdcan_tx::tx_fd_std", "Tried to send with closed interface");
		return false;
	}

	STM32_FDCAN_DLC dlc;
	if(!dlc.from_len(data_len))
	{
		logger->log(LOG_LEVEL::WARN, "STM32_fdcan_tx::tx_fd_std", "STM32_FDCAN_DLC::from_len failed");
		return false;
	}

	FDCAN_TxHeaderTypeDef tx_head;

	tx_head.Identifier = id;
	tx_head.IdType = FDCAN_STANDARD_ID;
	tx_head.TxFrameType = FDCAN_DATA_FRAME;
	tx_head.DataLength = dlc.get_fdcan_dlc();

	switch(esi)
	{
		case ESI::PASSIVE:
		{
			tx_head.ErrorStateIndicator = FDCAN_ESI_PASSIVE;
			break;
		}
		case ESI::ACTIVE:
		{
			tx_head.ErrorStateIndicator = FDCAN_ESI_ACTIVE;
			break;
		}
		default:
		{
			logger->log(LOG_LEVEL::WARN, "STM32_fdcan_tx::tx_fd_std", "ESI conv failed");
			return false;
		}
	}

	switch(brs)
	{
		case BRS::OFF:
		{
			tx_head.BitRateSwitch = FDCAN_BRS_OFF;
			break;
		}
		case BRS::ON:
		{
			tx_head.BitRateSwitch = FDCAN_BRS_ON;
			break;
		}
		default:
		{
			logger->log(LOG_LEVEL::WARN, "STM32_fdcan_tx::tx_fd_std", "BRS conv failed");
			return false;
		}
	}

	tx_head.FDFormat = FDCAN_FD_CAN;
	tx_head.TxEventFifoControl = FDCAN_NO_TX_EVENTS;
	tx_head.MessageMarker = 0;

	std::array<uint8_t, 64> out_data;
	std::copy_n(data, data_len, out_data.begin());

	return send_packet(tx_head, out_data.data());
}
bool STM32_fdcan_tx::tx_fd_ext(const uint32_t id, const BRS brs, const ESI esi, const uint8_t data_len, const uint8_t* data)
{
	freertos_util::logging::Logger* const logger = freertos_util::logging::Global_logger::get();
	using freertos_util::logging::LOG_LEVEL;

	logger->log(LOG_LEVEL::TRACE, "STM32_fdcan_tx::tx_fd_ext", "");

	if(!m_is_open)
	{
		logger->log(LOG_LEVEL::WARN, "STM32_fdcan_tx::tx_fd_ext", "Tried to send with closed interface");
		return false;
	}

	STM32_FDCAN_DLC dlc;
	if(!dlc.from_len(data_len))
	{
		logger->log(LOG_LEVEL::WARN, "STM32_fdcan_tx::tx_fd_ext", "STM32_FDCAN_DLC::from_len failed");
		return false;
	}

	FDCAN_TxHeaderTypeDef tx_head;
	
